vlm/base/Catalogs/НастройкиПодключенияКОблачнымКассам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>НастройкиПодключенияКОблачнымКассам</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОблачнаяКасса</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОблачнаяКасса</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресСервиса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

vlm/base/Catalogs/НастройкиПодключенияКОблачнымКассам/Ext/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Определяет наличие настроек подключения к Облачной кассе.
//
// Возвращаемое значение:
//  Булево - если Истина, есть настройки подключения.
//
Функция ЕстьНастройкиПодключения() Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИСТИНА КАК Признак
	|ИЗ
	|	Справочник.НастройкиПодключенияКОблачнымКассам КАК НастройкиПодключенияКОблачнымКассам";
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

// Выполняет поиск настройки подключения к Облачной кассе.
//
// Параметры:
//  ЗначениеПоиска - ОпределяемыйТип.ОблачнаяКасса - ссылка на элемент справочника для которого настроена интеграция с
//    Облачной кассой.
//                 - СправочникСсылка.НастройкиПодключенияКОблачнымКассам
//
// Возвращаемое значение:
//  Неопределено - настройка не найдена.
//  Структура:
//    * Ссылка - СправочникСсылка.НастройкиПодключенияКОблачнымКассам
//    * Идентификатор - Строка
//
Функция НастройкаПодключения(ЗначениеПоиска) Экспорт
	
	Результат = Неопределено;
	
	Если Не ЗначениеЗаполнено(ЗначениеПоиска) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ЗначениеПоиска", ЗначениеПоиска);
	
	Если ТипЗнч(ЗначениеПоиска) = Тип("СправочникСсылка.НастройкиПодключенияКОблачнымКассам") Тогда
		Запрос.Текст =
		"ВЫБРАТЬ
		|	НастройкиПодключенияКОблачнымКассам.Ссылка КАК Ссылка,
		|	НастройкиПодключенияКОблачнымКассам.Идентификатор КАК Идентификатор
		|ИЗ
		|	Справочник.НастройкиПодключенияКОблачнымКассам КАК НастройкиПодключенияКОблачнымКассам
		|ГДЕ
		|	НастройкиПодключенияКОблачнымКассам.Ссылка = &ЗначениеПоиска";
	Иначе
		Запрос.Текст =
		"ВЫБРАТЬ
		|	НастройкиПодключенияКОблачнымКассам.Ссылка КАК Ссылка,
		|	НастройкиПодключенияКОблачнымКассам.Идентификатор КАК Идентификатор
		|ИЗ
		|	Справочник.НастройкиПодключенияКОблачнымКассам КАК НастройкиПодключенияКОблачнымКассам
		|ГДЕ
		|	НастройкиПодключенияКОблачнымКассам.ОблачнаяКасса = &ЗначениеПоиска";
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		Результат = Новый Структура();
		Результат.Вставить("Ссылка"       , Выборка.Ссылка);
		Результат.Вставить("Идентификатор", Выборка.Идентификатор);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
